<?php 

$book = array(
	"Рей Брэдбери" => ["451° по Фаренгейту", "Вино из одуванчиков"],
	"Грегори Дэвид Робертс" => ["Шантарам", "Тень горы"],
	"Джордж Оруэлл" => "1984",
	"Михаил Афанасьевич Булгаков" => "Мастер и Маргарита",
	"Эрих Мария Ремарк" => "Три товарища",
	"Оскар Уайльд" => "Портрет Дориана Грея",
	"Даниел Киз" => "Цветы для Элджернона",
	"Джером Д. Сэлинджер" => "Над пропастью во ржи",
	"Антуан де Сент-Экзюпери" => "Маленький принц",
	"Лев Толстой" => "Анна Каренина",
	"Габриэль Гарсиа Маркес" => "Сто лет одиночества",
	"Айн Рэнд" => "Атлант расправил плечи",
);

echo "<ol>";
foreach ($book as $author => $bookName) {
	if (is_array($bookName)) {
		echo "<li>$author:</li>";
		echo "<ul>";
		foreach ($bookName as $booklist) {

			echo "<li> $booklist </li>";
		}
		echo "</ul>";
	} else {
		echo "<li> $author: <ul> <li> $bookName </li> </ul> </li>";
	}
}
echo "</ol>";

 ?>